mininet> nodes
available nodes are: 
h1 h2 h3 h4 h5 h6 h7 s1
mininet> net
h1 h1-eth0:s1-eth1
h2 h2-eth0:s1-eth2
h3 h3-eth0:s1-eth3
h4 h4-eth0:s1-eth4
h5 h5-eth0:s1-eth5
h6 h6-eth0:s1-eth6
h7 h7-eth0:s1-eth7
s1 lo:  s1-eth1:h1-eth0 s1-eth2:h2-eth0 s1-eth3:h3-eth0 s1-eth4:h4-eth0 s1-eth5:h5-eth0 s1-eth6:h6-eth0 s1-eth7:h7-eth0
mininet> dump
<Host h1: h1-eth0:10.0.0.1 pid=7286> 
<Host h2: h2-eth0:10.0.0.2 pid=7293> 
<Host h3: h3-eth0:10.0.0.3 pid=7302> 
<Host h4: h4-eth0:10.0.0.4 pid=7310> 
<Host h5: h5-eth0:10.0.0.5 pid=7316> 
<Host h6: h6-eth0:10.0.0.6 pid=7322> 
<Host h7: h7-eth0:10.0.0.7 pid=7328> 
<OVSSwitch s1: lo:127.0.0.1,s1-eth1:None,s1-eth2:None,s1-eth3:None,s1-eth4:None,s1-eth5:None,s1-eth6:None,s1-eth7:None pid=7281> 
mininet> pingall
*** Ping: testing ping reachability
h1 -> h2 h3 h4 h5 h6 h7 
h2 -> h1 h3 h4 h5 h6 h7 
h3 -> h1 h2 h4 h5 h6 h7 
h4 -> h1 h2 h3 h5 h6 h7 
h5 -> h1 h2 h3 h4 h6 h7 
h6 -> h1 h2 h3 h4 h5 h7 
h7 -> h1 h2 h3 h4 h5 h6 
*** Results: 0% dropped (42/42 received)
mininet> sh ovs-appctl fdb/show  s1
 port  VLAN  MAC                Age
    3     0  5a:9a:58:7a:2d:16    2
    1     0  ee:aa:85:58:cf:6a    2
    4     0  f6:e1:b3:80:d3:32    2
    5     0  4a:f4:73:eb:66:dc    2
    6     0  2e:dd:aa:08:f1:4d    2
    7     0  3a:be:1a:42:6f:4c    2
    2     0  5e:df:71:5b:c9:9f    2
mininet> h1 ping h2
PING 10.0.0.2 (10.0.0.2) 56(84) bytes of data.
64 bytes from 10.0.0.2: icmp_seq=1 ttl=64 time=0.354 ms
64 bytes from 10.0.0.2: icmp_seq=2 ttl=64 time=0.085 ms
64 bytes from 10.0.0.2: icmp_seq=3 ttl=64 time=0.099 ms
64 bytes from 10.0.0.2: icmp_seq=4 ttl=64 time=0.062 ms
64 bytes from 10.0.0.2: icmp_seq=5 ttl=64 time=0.060 ms
64 bytes from 10.0.0.2: icmp_seq=6 ttl=64 time=0.087 ms
64 bytes from 10.0.0.2: icmp_seq=7 ttl=64 time=0.090 ms
64 bytes from 10.0.0.2: icmp_seq=8 ttl=64 time=0.059 ms
^C
--- 10.0.0.2 ping statistics ---
8 packets transmitted, 8 received, 0% packet loss, time 7084ms
rtt min/avg/max/mdev = 0.059/0.112/0.354/0.092 ms
mininet> link s1 h1 down
mininet> pingall
*** Ping: testing ping reachability
h1 -> X X X X X X 
h2 -> X h3 h4 h5 h6 h7 
h3 -> X h2 h4 h5 h6 h7 
h4 -> X h2 h3 h5 h6 h7 
h5 -> X h2 h3 h4 h6 h7 
h6 -> X h2 h3 h4 h5 h7 
h7 -> X h2 h3 h4 h5 h6 
*** Results: 28% dropped (30/42 received)
mininet> sh ovs-appctl fdb/show  s1
 port  VLAN  MAC                Age
    1     0  ee:aa:85:58:cf:6a   98
    2     0  5e:df:71:5b:c9:9f    5
    3     0  5a:9a:58:7a:2d:16    5
    4     0  f6:e1:b3:80:d3:32    5
    5     0  4a:f4:73:eb:66:dc    5
    6     0  2e:dd:aa:08:f1:4d    4
    7     0  3a:be:1a:42:6f:4c    4
mininet> h1 ping h2
ping: connect: Network is unreachable
mininet> link s1 h1 up
mininet> pingall
*** Ping: testing ping reachability
h1 -> h2 h3 h4 h5 h6 h7 
h2 -> h1 h3 h4 h5 h6 h7 
h3 -> h1 h2 h4 h5 h6 h7 
h4 -> h1 h2 h3 h5 h6 h7 
h5 -> h1 h2 h3 h4 h6 h7 
h6 -> h1 h2 h3 h4 h5 h7 
h7 -> h1 h2 h3 h4 h5 h6 
*** Results: 0% dropped (42/42 received)
mininet> sh ovs-appctl fdb/show  s1
 port  VLAN  MAC                Age
    6     0  2e:dd:aa:08:f1:4d    8
    7     0  3a:be:1a:42:6f:4c    8
    5     0  4a:f4:73:eb:66:dc    8
    4     0  f6:e1:b3:80:d3:32    8
    3     0  5a:9a:58:7a:2d:16    8
    2     0  5e:df:71:5b:c9:9f    8
    1     0  ee:aa:85:58:cf:6a    3
mininet> h1 ping h2
PING 10.0.0.2 (10.0.0.2) 56(84) bytes of data.
64 bytes from 10.0.0.2: icmp_seq=1 ttl=64 time=0.426 ms
64 bytes from 10.0.0.2: icmp_seq=2 ttl=64 time=0.089 ms
64 bytes from 10.0.0.2: icmp_seq=3 ttl=64 time=0.056 ms
64 bytes from 10.0.0.2: icmp_seq=4 ttl=64 time=0.073 ms
64 bytes from 10.0.0.2: icmp_seq=5 ttl=64 time=0.060 ms
64 bytes from 10.0.0.2: icmp_seq=6 ttl=64 time=0.077 ms
64 bytes from 10.0.0.2: icmp_seq=7 ttl=64 time=0.067 ms
^C
--- 10.0.0.2 ping statistics ---
7 packets transmitted, 7 received, 0% packet loss, time 6092ms
rtt min/avg/max/mdev = 0.056/0.121/0.426/0.124 ms
mininet> 


---
sudo python switch_base_topo.py  --host 10 

mininet> dump
<Host h1: h1-eth0:10.0.0.1 pid=7818> 
<Host h2: h2-eth0:10.0.0.2 pid=7824> 
<Host h3: h3-eth0:10.0.0.3 pid=7835> 
<Host h4: h4-eth0:10.0.0.4 pid=7841> 
<Host h5: h5-eth0:10.0.0.5 pid=7847> 
<Host h6: h6-eth0:10.0.0.6 pid=7853> 
<Host h7: h7-eth0:10.0.0.7 pid=7859> 
<Host h8: h8-eth0:10.0.0.8 pid=7865> 
<Host h9: h9-eth0:10.0.0.9 pid=7871> 
<Host h10: h10-eth0:10.0.0.10 pid=7879> 
<OVSSwitch s1: lo:127.0.0.1,s1-eth1:None,s1-eth2:None,s1-eth3:None,s1-eth4:None,s1-eth5:None,s1-eth6:None,s1-eth7:None,s1-eth8:None,s1-eth9:None,s1-eth10:None pid=7813> 
